app/Models/CategoryModel.php

select * from `categories` order by `created_at` desc limit 1 offset 2
select count(*) as aggregate from `categories`
---
    public function getAllCategories()
    {
        return $this::latest()->paginate(1);

select * from `categories` where `categories`.`id` = '...' limit 1
---
    public function getCategoryById($id)
    {
        return $this::find($id);

select `id`, `category_name` from `categories` where `category_status` = 1
---
    public function getCategoryNames()
    {
        return $this::where('category_status', 1)->select('id', 'category_name')->get();