app/Models/PostModel.php

    public function getAllPosts()
    {
        return $this::latest()->paginate(1);
---
select * from `posts` order by `created_at` desc limit 1 offset 0
select count(*) as aggregate from `posts`

    public function postCheck($postTitle)
    {
        return $this::where('post_title', $postTitle)->first();
---
select * from `posts` where `post_title` = 'qưeqweqw' limit 1

    public function getPostById($id)
    {
        return $this::find($id);
---
select * from `posts` where `posts`.`id` = '...' limit 1

    public function postSearch($keyword)
    {
        return $this::where('post_title', 'like', '%' . $keyword . '%')
            ->orWhere('post_content', 'like', '%' . $keyword . '%')
            ->paginate(1);
---
select * from `posts` where `post_title` like '%vlog%' or `post_content` like '%vlog%' limit 1 offset 0
select count(*) as aggregate from `posts` where `post_title` like '%vlog%' or `post_content` like '%vlog%'