app/Models/User.php

select * from `users` order by `created_at` desc limit 1 offset 0
select count(*) as aggregate from `users`
---
    public function getAllUsers()
    {
        return $this::latest()->paginate(1);

select * from `users` where `users`.`id` = '5' limit 1
---
    public function getUserById($id)
    {
        return $this::find($id);