app/Http/Controllers/Admin/CategoryController.php

select * from `categories` order by `created_at` desc limit 1 offset 1
---
    public function create(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'categoryName' => 'required|min:3|max:20',
        ], [
            'categoryName.required' => 'You have not entered your category name',
            'categoryName.min' => 'Category name must be at least 3 characters long',
            'categoryName.max' => 'category name must be no longer than 20 characters',
        ]);