app/Http/Controllers/Admin/PostController.php

            $newPost->post_image = $imgName;
            $newPost->category_id = $request->categoryId;

            $newPost->save();
---
insert into `posts` (`post_title`, `post_content`, `post_image`, `category_id`, `updated_at`, `created_at`) values ('Rộ tin Kim Soo Hyun nhận cát xê 236 tỷ đồng cho Queen Of Tears, nhà sản xuất hé lộ sự thật không ngờ!', 'sadadad', '003f.jpg', '1', '2024-03-27 10:07:52', '2024-03-27 10:07:52')

    public function delete($id)
    {
        $post = new PostModel();
        $postItem = $post->getPostById($id);
        $postItem->delete();
---
delete from `posts` where `id` = 2