app/Http/Controllers/Admin/UserController.php

    public function create(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'phone' => 'required|regex:/^([0-9\s\-\+\(\)]*)$/|min:10',
            'password' => 'required|min:8|max:20',
            'userName' => 'required|min:3',
            'dateOfBirth' => 'required|date|date_format:Y-m-d',
        ], [
            'phone.required' => 'You have not entered your phone number',
            'phone.regex' => 'You have entered an invalid phone number format',
            'phone.min' => 'Phone numbers must be at least 10 characters long',
            'password.required' => 'You have not entered your password',
            'password.min' => 'Password must be at least 8 characters long',
            'password.max' => 'Passwords must be no longer than 20 characters',
            'userName.required' => 'You have not entered your user name',
            'userName.min' => 'User name must be at least 3 characters long',
            'dateOfBirth.required' => 'You have not entered your date of birth',
            'dateOfBirth.date' => 'You have entered an invalid date of birth',
            'dateOfBirth.date_format' => 'Date of birth must be in the format YYYY-MM-DD.',
        ]);
---
select * from `users` order by `created_at` desc limit 1 offset 0